Tekla Open API Reference for Tekla Structures 2025
LoadingForm Class
 The LoadingForm class creates a dialog that is shown while something is being loaded by the main window and that needs the process to finish.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.UIControls.LoadingForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class LoadingForm : Form
Public Class LoadingForm
	Inherits Form
The LoadingForm type exposes the following members.
Constructors
Name | Description
LoadingForm
 Creates a new instance of the form.
Top
Properties
Name | Description
AllowClosing
 Allows the closing of the dialog. By default disabled.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace